bench/results/nginx/fsBrev_f1k_c8.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f1k.bin
Document Length:        1024 bytes

Concurrency Level:      8
Time taken for tests:   6.941 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      25460000 bytes
HTML transferred:       20480000 bytes
Requests per second:    2881.30 [#/sec] (mean)
Time per request:       2.777 [ms] (mean)
Time per request:       0.347 [ms] (mean, across all concurrent requests)
Transfer rate:          3581.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  19.4      0     520
Processing:     0    2  22.2      0     521
Waiting:        0    2  22.2      0     521
Total:          0    3  29.5      1     525

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      2
  99%      8
 100%    525 (longest request)