bench/results/nginx/fsBrev_f1k_c8_p1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f1k.bin
Document Length:        1024 bytes

Concurrency Level:      8
Time taken for tests:   8.176 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      25460000 bytes
HTML transferred:       20480000 bytes
Requests per second:    2446.30 [#/sec] (mean)
Time per request:       3.270 [ms] (mean)
Time per request:       0.409 [ms] (mean, across all concurrent requests)
Transfer rate:          3041.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  22.6      0     537
Processing:     0    2  25.7      0     538
Waiting:        0    2  25.7      0     538
Total:          0    3  34.2      0     541

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      1
  90%      1
  95%      1
  98%      2
  99%      8
 100%    541 (longest request)