bench/results/nginx/fsBrev_f48k_c1_p1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f48k.bin
Document Length:        49152 bytes

Concurrency Level:      1
Time taken for tests:   5.496 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      247015000 bytes
HTML transferred:       245760000 bytes
Requests per second:    909.69 [#/sec] (mean)
Time per request:       1.099 [ms] (mean)
Time per request:       1.099 [ms] (mean, across all concurrent requests)
Transfer rate:          43887.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       4
Processing:     0    1  20.2      0     510
Waiting:        0    1  20.0      0     505
Total:          0    1  20.2      0     510

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      1
 100%    510 (longest request)